; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-2)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x1-y0
	loc-x1-y1
- place

)
(:init
	(at-robot loc-x1-y1)
	(visited loc-x1-y1)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x1-y0)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
)
)
)

; plan
1. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 1 of 4
2. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0)
   goals met: 1 of 4
3. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 2 of 4
4. (move loc-x0-y0 loc-x0-y1)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x0-y1)
   goals met: 2 of 4
5. (visit loc-x0-y1)
   added: (visited loc-x0-y1)
   goals met: 3 of 4
6. (move loc-x0-y1 loc-x1-y1)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x1-y1)
   goals met: 3 of 4
7. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 3 of 4
8. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 4 of 4
